Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMS70N20.xml
        <register caption="Programmable Clock 0 Register 6" name="PMC_PCK6" offset="0x58" rw="RW" size="4">
          <bitfield caption="Master Clock Source Selection" mask="0x00000007" name="CSS" values="PMC_PCK__CSS"/>
          <bitfield caption="Programmable Clock Prescaler" mask="0x00000FF0" name="PRES"/>
        </register>
        <register caption="Interrupt Enable Register" name="PMC_IER" offset="0x0060" rw="W" size="4">
          <bitfield caption="Main Crystal Oscillator Status Interrupt Enable" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Interrupt Enable" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="Master Clock Ready Interrupt Enable" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="UTMI PLL Lock Interrupt Enable" mask="0x00000040" name="LOCKU"/>
          <bitfield caption="Programmable Clock Ready 0 Interrupt Enable" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready 1 Interrupt Enable" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready 2 Interrupt Enable" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Programmable Clock Ready 3 Interrupt Enable" mask="0x00000800" name="PCKRDY3"/>
          <bitfield caption="Programmable Clock Ready 4 Interrupt Enable" mask="0x00001000" name="PCKRDY4"/>
          <bitfield caption="Programmable Clock Ready 5 Interrupt Enable" mask="0x00002000" name="PCKRDY5"/>
          <bitfield caption="Programmable Clock Ready 6 Interrupt Enable" mask="0x00004000" name="PCKRDY6"/>
          <bitfield caption="Main Oscillator Selection Status Interrupt Enable" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main On-Chip RC Status Interrupt Enable" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event Interrupt Enable" mask="0x00040000" name="CFDEV"/>
          <bitfield caption="Slow Crystal Oscillator Error Interrupt Enable" mask="0x00200000" name="XT32KERR"/>
        </register>
        <register caption="Interrupt Disable Register" name="PMC_IDR" offset="0x0064" rw="W" size="4">
          <bitfield caption="Main Crystal Oscillator Status Interrupt Disable" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Interrupt Disable" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="Master Clock Ready Interrupt Disable" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="UTMI PLL Lock Interrupt Disable" mask="0x00000040" name="LOCKU"/>
          <bitfield caption="Programmable Clock Ready 0 Interrupt Disable" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready 1 Interrupt Disable" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready 2 Interrupt Disable" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Programmable Clock Ready 3 Interrupt Disable" mask="0x00000800" name="PCKRDY3"/>
          <bitfield caption="Programmable Clock Ready 4 Interrupt Disable" mask="0x00001000" name="PCKRDY4"/>
          <bitfield caption="Programmable Clock Ready 5 Interrupt Disable" mask="0x00002000" name="PCKRDY5"/>
          <bitfield caption="Programmable Clock Ready 6 Interrupt Disable" mask="0x00004000" name="PCKRDY6"/>
          <bitfield caption="Main Oscillator Selection Status Interrupt Disable" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main On-Chip RC Status Interrupt Disable" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event Interrupt Disable" mask="0x00040000" name="CFDEV"/>
          <bitfield caption="Slow Crystal Oscillator Error Interrupt Disable" mask="0x00200000" name="XT32KERR"/>
        </register>
        <register caption="Status Register" name="PMC_SR" offset="0x0068" rw="R" size="4">
          <bitfield caption="Main Crystal Oscillator Status" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Status" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="Master Clock Status" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="UTMI PLL Lock Status" mask="0x00000040" name="LOCKU"/>
          <bitfield caption="Slow Clock Oscillator Selection" mask="0x00000080" name="OSCSELS"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00000800" name="PCKRDY3"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00001000" name="PCKRDY4"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00002000" name="PCKRDY5"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00004000" name="PCKRDY6"/>
          <bitfield caption="Main Oscillator Selection Status" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main On-Chip RC Oscillator Status" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event" mask="0x00040000" name="CFDEV"/>
          <bitfield caption="Clock Failure Detector Status" mask="0x00080000" name="CFDS"/>
          <bitfield caption="Clock Failure Detector Fault Output Status" mask="0x00100000" name="FOS"/>
          <bitfield caption="Slow Crystal Oscillator Error" mask="0x00200000" name="XT32KERR"/>
        </register>
        <register caption="Interrupt Mask Register" name="PMC_IMR" offset="0x006C" rw="R" size="4">
          <bitfield caption="Main Crystal Oscillator Status Interrupt Mask" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Interrupt Mask" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="Master Clock Ready Interrupt Mask" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="UTMI PLL Lock Interrupt Mask" mask="0x00000040" name="LOCKU"/>
          <bitfield caption="Programmable Clock Ready 0 Interrupt Mask" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready 1 Interrupt Mask" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready 2 Interrupt Mask" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Main Oscillator Selection Status Interrupt Mask" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main On-Chip RC Status Interrupt Mask" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event Interrupt Mask" mask="0x00040000" name="CFDEV"/>
          <bitfield caption="Slow Crystal Oscillator Error Interrupt Mask" mask="0x00200000" name="XT32KERR"/>
        </register>
