Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMS70N20.xml
        <register caption="Host Pipe Enable Register (n = 0) 5" name="USBHS_HSTPIPIER5" offset="0x604" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINES"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTES"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPES"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRES"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIES"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIES"/>
          <bitfield caption="Number of Busy Banks Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMAS"/>
          <bitfield caption="Pipe Freeze Enable" mask="0x00020000" name="PFREEZES"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
        </register>
        <register caption="Host Pipe Enable Register (n = 0) 6" name="USBHS_HSTPIPIER6" offset="0x608" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINES"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTES"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPES"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRES"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIES"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIES"/>
          <bitfield caption="Number of Busy Banks Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMAS"/>
          <bitfield caption="Pipe Freeze Enable" mask="0x00020000" name="PFREEZES"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
        </register>
        <register caption="Host Pipe Enable Register (n = 0) 7" name="USBHS_HSTPIPIER7" offset="0x60C" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINES"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTES"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPES"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRES"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIES"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIES"/>
          <bitfield caption="Number of Busy Banks Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMAS"/>
          <bitfield caption="Pipe Freeze Enable" mask="0x00020000" name="PFREEZES"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
        </register>
        <register caption="Host Pipe Enable Register (n = 0) 8" name="USBHS_HSTPIPIER8" offset="0x610" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINES"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTES"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPES"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRES"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIES"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIES"/>
          <bitfield caption="Number of Busy Banks Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMAS"/>
          <bitfield caption="Pipe Freeze Enable" mask="0x00020000" name="PFREEZES"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
        </register>
        <register caption="Host Pipe Enable Register (n = 0) 9" name="USBHS_HSTPIPIER9" offset="0x614" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINES"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTES"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPES"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRES"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIES"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIES"/>
          <bitfield caption="Number of Busy Banks Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMAS"/>
          <bitfield caption="Pipe Freeze Enable" mask="0x00020000" name="PFREEZES"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
        </register>
        <register caption="Host Pipe Disable Register (n = 0) 0" name="USBHS_HSTPIPIDR0" offset="0x620" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Disable" mask="0x00000001" name="RXINEC"/>
          <bitfield caption="Transmitted OUT Data Interrupt Disable" mask="0x00000002" name="TXOUTEC"/>
          <bitfield caption="Transmitted SETUP Interrupt Disable" mask="0x00000004" name="TXSTPEC"/>
          <bitfield caption="Pipe Error Interrupt Disable" mask="0x00000008" name="PERREC"/>
          <bitfield caption="NAKed Interrupt Disable" mask="0x00000010" name="NAKEDEC"/>
          <bitfield caption="Overflow Interrupt Disable" mask="0x00000020" name="OVERFIEC"/>
          <bitfield caption="Received STALLed Interrupt Disable" mask="0x00000040" name="RXSTALLDEC"/>
          <bitfield caption="Short Packet Interrupt Disable" mask="0x00000080" name="SHORTPACKETIEC"/>
          <bitfield caption="Number of Busy Banks Disable" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Disable" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Disable" mask="0x00010000" name="PDISHDMAC"/>
          <bitfield caption="Pipe Freeze Disable" mask="0x00020000" name="PFREEZEC"/>
        </register>
        <register caption="Host Pipe Disable Register (n = 0) 1" name="USBHS_HSTPIPIDR1" offset="0x624" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Disable" mask="0x00000001" name="RXINEC"/>
          <bitfield caption="Transmitted OUT Data Interrupt Disable" mask="0x00000002" name="TXOUTEC"/>
          <bitfield caption="Transmitted SETUP Interrupt Disable" mask="0x00000004" name="TXSTPEC"/>
          <bitfield caption="Pipe Error Interrupt Disable" mask="0x00000008" name="PERREC"/>
          <bitfield caption="NAKed Interrupt Disable" mask="0x00000010" name="NAKEDEC"/>
          <bitfield caption="Overflow Interrupt Disable" mask="0x00000020" name="OVERFIEC"/>
          <bitfield caption="Received STALLed Interrupt Disable" mask="0x00000040" name="RXSTALLDEC"/>
          <bitfield caption="Short Packet Interrupt Disable" mask="0x00000080" name="SHORTPACKETIEC"/>
          <bitfield caption="Number of Busy Banks Disable" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Disable" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Disable" mask="0x00010000" name="PDISHDMAC"/>
          <bitfield caption="Pipe Freeze Disable" mask="0x00020000" name="PFREEZEC"/>
        </register>
        <register caption="Host Pipe Disable Register (n = 0) 2" name="USBHS_HSTPIPIDR2" offset="0x628" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Disable" mask="0x00000001" name="RXINEC"/>
          <bitfield caption="Transmitted OUT Data Interrupt Disable" mask="0x00000002" name="TXOUTEC"/>
          <bitfield caption="Transmitted SETUP Interrupt Disable" mask="0x00000004" name="TXSTPEC"/>
          <bitfield caption="Pipe Error Interrupt Disable" mask="0x00000008" name="PERREC"/>
          <bitfield caption="NAKed Interrupt Disable" mask="0x00000010" name="NAKEDEC"/>
          <bitfield caption="Overflow Interrupt Disable" mask="0x00000020" name="OVERFIEC"/>
          <bitfield caption="Received STALLed Interrupt Disable" mask="0x00000040" name="RXSTALLDEC"/>
          <bitfield caption="Short Packet Interrupt Disable" mask="0x00000080" name="SHORTPACKETIEC"/>
          <bitfield caption="Number of Busy Banks Disable" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Disable" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Disable" mask="0x00010000" name="PDISHDMAC"/>
          <bitfield caption="Pipe Freeze Disable" mask="0x00020000" name="PFREEZEC"/>
        </register>
        <register caption="Host Pipe Disable Register (n = 0) 3" name="USBHS_HSTPIPIDR3" offset="0x62C" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Disable" mask="0x00000001" name="RXINEC"/>
          <bitfield caption="Transmitted OUT Data Interrupt Disable" mask="0x00000002" name="TXOUTEC"/>
          <bitfield caption="Transmitted SETUP Interrupt Disable" mask="0x00000004" name="TXSTPEC"/>
          <bitfield caption="Pipe Error Interrupt Disable" mask="0x00000008" name="PERREC"/>
          <bitfield caption="NAKed Interrupt Disable" mask="0x00000010" name="NAKEDEC"/>
          <bitfield caption="Overflow Interrupt Disable" mask="0x00000020" name="OVERFIEC"/>
          <bitfield caption="Received STALLed Interrupt Disable" mask="0x00000040" name="RXSTALLDEC"/>
          <bitfield caption="Short Packet Interrupt Disable" mask="0x00000080" name="SHORTPACKETIEC"/>
          <bitfield caption="Number of Busy Banks Disable" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Disable" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Disable" mask="0x00010000" name="PDISHDMAC"/>
          <bitfield caption="Pipe Freeze Disable" mask="0x00020000" name="PFREEZEC"/>
        </register>
        <register caption="Host Pipe Disable Register (n = 0) 4" name="USBHS_HSTPIPIDR4" offset="0x630" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Disable" mask="0x00000001" name="RXINEC"/>
          <bitfield caption="Transmitted OUT Data Interrupt Disable" mask="0x00000002" name="TXOUTEC"/>
          <bitfield caption="Transmitted SETUP Interrupt Disable" mask="0x00000004" name="TXSTPEC"/>
          <bitfield caption="Pipe Error Interrupt Disable" mask="0x00000008" name="PERREC"/>
          <bitfield caption="NAKed Interrupt Disable" mask="0x00000010" name="NAKEDEC"/>
          <bitfield caption="Overflow Interrupt Disable" mask="0x00000020" name="OVERFIEC"/>
          <bitfield caption="Received STALLed Interrupt Disable" mask="0x00000040" name="RXSTALLDEC"/>
          <bitfield caption="Short Packet Interrupt Disable" mask="0x00000080" name="SHORTPACKETIEC"/>
          <bitfield caption="Number of Busy Banks Disable" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Disable" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Disable" mask="0x00010000" name="PDISHDMAC"/>
          <bitfield caption="Pipe Freeze Disable" mask="0x00020000" name="PFREEZEC"/>
        </register>
        <register caption="Host Pipe Disable Register (n = 0) 5" name="USBHS_HSTPIPIDR5" offset="0x634" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Disable" mask="0x00000001" name="RXINEC"/>
          <bitfield caption="Transmitted OUT Data Interrupt Disable" mask="0x00000002" name="TXOUTEC"/>
          <bitfield caption="Transmitted SETUP Interrupt Disable" mask="0x00000004" name="TXSTPEC"/>
          <bitfield caption="Pipe Error Interrupt Disable" mask="0x00000008" name="PERREC"/>
          <bitfield caption="NAKed Interrupt Disable" mask="0x00000010" name="NAKEDEC"/>
          <bitfield caption="Overflow Interrupt Disable" mask="0x00000020" name="OVERFIEC"/>
          <bitfield caption="Received STALLed Interrupt Disable" mask="0x00000040" name="RXSTALLDEC"/>
          <bitfield caption="Short Packet Interrupt Disable" mask="0x00000080" name="SHORTPACKETIEC"/>
          <bitfield caption="Number of Busy Banks Disable" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Disable" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Disable" mask="0x00010000" name="PDISHDMAC"/>
          <bitfield caption="Pipe Freeze Disable" mask="0x00020000" name="PFREEZEC"/>
        </register>
        <register caption="Host Pipe Disable Register (n = 0) 6" name="USBHS_HSTPIPIDR6" offset="0x638" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Disable" mask="0x00000001" name="RXINEC"/>
          <bitfield caption="Transmitted OUT Data Interrupt Disable" mask="0x00000002" name="TXOUTEC"/>
          <bitfield caption="Transmitted SETUP Interrupt Disable" mask="0x00000004" name="TXSTPEC"/>
          <bitfield caption="Pipe Error Interrupt Disable" mask="0x00000008" name="PERREC"/>
          <bitfield caption="NAKed Interrupt Disable" mask="0x00000010" name="NAKEDEC"/>
          <bitfield caption="Overflow Interrupt Disable" mask="0x00000020" name="OVERFIEC"/>
          <bitfield caption="Received STALLed Interrupt Disable" mask="0x00000040" name="RXSTALLDEC"/>
          <bitfield caption="Short Packet Interrupt Disable" mask="0x00000080" name="SHORTPACKETIEC"/>
          <bitfield caption="Number of Busy Banks Disable" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Disable" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Disable" mask="0x00010000" name="PDISHDMAC"/>
          <bitfield caption="Pipe Freeze Disable" mask="0x00020000" name="PFREEZEC"/>
        </register>
        <register caption="Host Pipe Disable Register (n = 0) 7" name="USBHS_HSTPIPIDR7" offset="0x63C" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Disable" mask="0x00000001" name="RXINEC"/>
          <bitfield caption="Transmitted OUT Data Interrupt Disable" mask="0x00000002" name="TXOUTEC"/>
          <bitfield caption="Transmitted SETUP Interrupt Disable" mask="0x00000004" name="TXSTPEC"/>
          <bitfield caption="Pipe Error Interrupt Disable" mask="0x00000008" name="PERREC"/>
          <bitfield caption="NAKed Interrupt Disable" mask="0x00000010" name="NAKEDEC"/>
          <bitfield caption="Overflow Interrupt Disable" mask="0x00000020" name="OVERFIEC"/>
          <bitfield caption="Received STALLed Interrupt Disable" mask="0x00000040" name="RXSTALLDEC"/>
          <bitfield caption="Short Packet Interrupt Disable" mask="0x00000080" name="SHORTPACKETIEC"/>
          <bitfield caption="Number of Busy Banks Disable" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Disable" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Disable" mask="0x00010000" name="PDISHDMAC"/>
          <bitfield caption="Pipe Freeze Disable" mask="0x00020000" name="PFREEZEC"/>
        </register>
        <register caption="Host Pipe Disable Register (n = 0) 8" name="USBHS_HSTPIPIDR8" offset="0x640" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Disable" mask="0x00000001" name="RXINEC"/>
          <bitfield caption="Transmitted OUT Data Interrupt Disable" mask="0x00000002" name="TXOUTEC"/>
          <bitfield caption="Transmitted SETUP Interrupt Disable" mask="0x00000004" name="TXSTPEC"/>
          <bitfield caption="Pipe Error Interrupt Disable" mask="0x00000008" name="PERREC"/>
          <bitfield caption="NAKed Interrupt Disable" mask="0x00000010" name="NAKEDEC"/>
          <bitfield caption="Overflow Interrupt Disable" mask="0x00000020" name="OVERFIEC"/>
          <bitfield caption="Received STALLed Interrupt Disable" mask="0x00000040" name="RXSTALLDEC"/>
          <bitfield caption="Short Packet Interrupt Disable" mask="0x00000080" name="SHORTPACKETIEC"/>
          <bitfield caption="Number of Busy Banks Disable" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Disable" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Disable" mask="0x00010000" name="PDISHDMAC"/>
          <bitfield caption="Pipe Freeze Disable" mask="0x00020000" name="PFREEZEC"/>
        </register>
        <register caption="Host Pipe Disable Register (n = 0) 9" name="USBHS_HSTPIPIDR9" offset="0x644" rw="W" size="4">
          <bitfield caption="Received IN Data Interrupt Disable" mask="0x00000001" name="RXINEC"/>
          <bitfield caption="Transmitted OUT Data Interrupt Disable" mask="0x00000002" name="TXOUTEC"/>
          <bitfield caption="Transmitted SETUP Interrupt Disable" mask="0x00000004" name="TXSTPEC"/>
          <bitfield caption="Pipe Error Interrupt Disable" mask="0x00000008" name="PERREC"/>
          <bitfield caption="NAKed Interrupt Disable" mask="0x00000010" name="NAKEDEC"/>
          <bitfield caption="Overflow Interrupt Disable" mask="0x00000020" name="OVERFIEC"/>
          <bitfield caption="Received STALLed Interrupt Disable" mask="0x00000040" name="RXSTALLDEC"/>
          <bitfield caption="Short Packet Interrupt Disable" mask="0x00000080" name="SHORTPACKETIEC"/>
          <bitfield caption="Number of Busy Banks Disable" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Disable" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Disable" mask="0x00010000" name="PDISHDMAC"/>
          <bitfield caption="Pipe Freeze Disable" mask="0x00020000" name="PFREEZEC"/>
        </register>
